tutu/app/controllers/routes_controller.rb

INSERT INTO "routes" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Далекий"], ["created_at", "2016-02-07 23:21:18.870435"], ["updated_at", "2016-02-07 23:21:18.870435"]]
---
  def create
    @route = Route.new(route_params)
    if @route.save

UPDATE "routes" SET "title" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["title", "Ближайший"], ["updated_at", "2016-02-07 23:27:59.823859"], ["id", 2]]
---
  def update
    if @route.update(route_params)