tutu/app/controllers/trains_controller.rb

INSERT INTO "trains" ("number", "created_at", "updated_at") VALUES (?, ?, ?)  [["number", "234"], ["created_at", "2016-02-07 22:59:03.202649"], ["updated_at", "2016-02-07 22:59:03.202649"]]
---
  def create
    @train = Train.new(train_params)

    if @train.save

UPDATE "trains" SET "number" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["number", "567"], ["updated_at", "2016-02-07 23:08:26.709100"], ["id", 3]]
---
  def update
    if @train.update(train_params)